Revit 2026 API

# PostDocEventArgs Class

---

The class is used as base class for arguments of any post-event that is associated to a particular Document.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitEventArgs Autodesk.Revit.DB.EventsPostEventArgs Autodesk.Revit.DB.EventsPostDocEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PostDocEventArgs : PostEventArgs
```
```vb
Public Class PostDocEventArgs
	Inherits PostEventArgs
```
```cpp
public ref class PostDocEventArgs : public PostEventArgs
```
```fsharp
type PostDocEventArgs =
    class
        inherit PostEventArgs
    end
```

The PostDocEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it. (Inherited from RevitEventArgs) |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitEventArgs) |
|  | Document | The document associated with the event. |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an APIevent handler). (Inherited from PostEventArgs) |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace